Repository: cgoettel/mt-alignment-wrapper
Catalog: sample-files/2en-2fr.tmx
Source language: en
Languages: fr

source: I am under no illusion that this can be achieved by our own efforts alone without His very substantial and constant help.
fr: Je ne me fais pas la moindre illusion que cela puisse être réalisé par nos seuls efforts, sans son aide considérable et constante.

source: “We know that it is by grace that we are saved, after all we can do.”24 And we do not need to achieve some minimum level of capacity or goodness before God will help—divine aid can be ours every hour of every day, no matter where we are in the path of obedience.
fr: « Nous savons que c’est par la grâce que nous sommes sauvés, après tout ce que nous pouvons faire24. » Nous ne devons pas atteindre un certain niveau de capacité ou de bonté avant que Dieu nous vienne en aide. Nous pouvons recevoir cette aide à chaque heure de chaque jour, où que nous nous trouvions sur le chemin de l’obéissance.

source: But I know that beyond desiring His help, we must exert ourselves, repent, and choose God for Him to be able to act in our lives consistent with justice and moral agency.
fr: Mais je sais qu’en plus d’aspirer à son aide, nous devons faire tous nos efforts, nous repentir et choisir Dieu, pour qu’il puisse agir dans notre vie en accord avec la justice et le libre arbitre moral.

source: My plea is simply to take responsibility and go to work so that there is something for God to help us with.
fr: Mon exhortation est simplement que nous prenions nos responsabilités et que nous nous mettions au travail pour donner à Dieu quelque chose en quoi il puisse nous aider.

source: I bear witness that God the Father lives, that His Son, Jesus Christ, is our Redeemer, and that the Holy Spirit is present with us.
fr: Je témoigne que Dieu le Père vit, que Jésus-Christ, son Fils, est notre Rédempteur et que le Saint-Esprit est présent avec nous.

source: Their desire to help us is undoubted, and Their capacity to do so is infinite.
fr: Leur désir de nous aider est indubitable, et leur capacité de le faire est infinie. « [Réveillons-nous] et [levons-nous] de la poussière, […] afin que […] les alliances que le Père éternel a faites avec [nous] s’accomplissent25. »

source: Let us “awake, and arise from the dust, … that the covenants of the Eternal Father which he hath made unto [us] may be fulfilled.”25 In the name of Jesus Christ, amen.
fr: Au nom de Jésus-Christ. Amen.
